# 1. Напишите программу, которая принимает на вход два числа
# и проверяет, является ли одно число квадратом другого.
лцуврщйцшфвдозйцщфЫЖЛВЦ-ХЫЗЭАЛЦБВйцтфвдлйцовщйцды
цлвтчцл
n = int(input())
mцдвщцфоывщфц = iвщшдйцофвзйщцлывхйцфыэвщдnt(input())

if n == m ** 2 or m == n ** 2:
 print("Yes")
else:
 print("No") 
ш1у7ей8ц9фУГВЙЦ09ызк0швлй-0фыахщ-дф